{
  "basics": {
    "name": "Dylan Barth",
    "label": "Full-stack Web Developer",
    "picture": "",
    "email": "dylan.j.barth@gmail.com",
    "phone": "",
    "website": "http://dylanbarth.com",
    "summary": "Full-stack web development contractor. Currently full-time at GrowthIntel working in a small team on a predictive marketing tool that optimizes sales pipelines. Hard worker, fast learner, great communicator. Prior to GrowthIntel, I co-founded a small non-profit called Learning Equality where we built an open-source app that helped to provide access to an engaging learning experience for students around the world without Internet access.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Hosuton",
      "region": "Texas"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "dylan_barth",
        "url": "https://twitter.com/dylan_barth"
      },
      {
        "network": "GitHub",
        "username": "dylanjbarth",
        "url": "https://github.com/dylanjbarth/"
      },
      {
        "network": "Medium",
        "username": "@Dylan_Barth",
        "url": "https://medium.com/@Dylan_Barth"
      }
    ]
  },
  "work": [
    {
      "company": "GrowthIntel",
      "position": "Full-stack Web Development Contractor",
      "website": "http://growthintel.com",
      "startDate": "2015-06-15",
      "summary": "After moving from London to Houston, I accepted a contract with GrowthIntel as a full-time contractor. Projects I have completed as a contractor include:",
      "highlights": [
        "Leading a team in delivering a robust ETL framework using Python Luigi that included automated deployment with Ansible, scheduling and triggering, and data integrity reporting using Kibana.",
        "Upgrading our frontend codebase from React 0.13 to React 15, and ReactRouter from 0.13 to 2.6."
      ]
    },    {
      "company": "GrowthIntel",
      "position": "Full-stack Web Developer",
      "website": "http://growthintel.com",
      "startDate": "2015-03-15",
      "endDate": "2016-05-22",
      "summary": "As a full-stack engineer at GrowthIntel, I tackled a wide variety of technical challenges, including:",
      "highlights": [
        "Leading a team in delivering a from-scratch rewrite and redesign of a legacy Backbone.js frontend codebase in React.",
        "Refactoring a monolithic Python Tornado API into 4 domain separated microservices.",
        "Pairing with another developer to build a microservice which integrated our web app with Salesforce.com using the SFDC REST API.",
        "Working with a wide variety of web technologies including Elasticsearch, Apache Spark, and AWS (EC2, RDS, IAM, S3, SNS, Lambda).",
        "Speaking at bi-monthly company knowledge-sharing meetups on self-management, Python Luigi, creating pip packages, and browser networking.",
        "Speaking at PyData London 2015 on building data processing pipelines with Python Luigi."
      ]
    },
    {
      "company": "Learning Equality",
      "position": "Co-Founder, Full-stack Web Developer",
      "website": "http://learningequality.org",
      "startDate": "2012-01-01",
      "endDate": "2014-11-22",
      "summary": "Learning Equality is a non-profit organization committed to enabling global access to high-quality open educational resources.",
      "highlights": [
        "Core developer of the initial KA Lite platform, a pure Python web app which provided offline learning communities access to Khan Academy content and an interactive learning experience.",
        "Raised over $300K in grants and donations within the first year of the organization being founded.",
        "Led development of key partnerships with organizations including UNICEF, War Child Holland, and the Hewlett Foundation."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of California, San Diego",
      "area": "Cognitive Science, Human-Computer Interaction",
      "studyType": "Bachelor of Science",
      "startDate": "2009-08-01",
      "endDate": "2013-06-01",
      "gpa": "3.6",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "keywords": [
        "Python", "JavaScript", "React", "MySQL", "Elasticsearch", "AWS"
      ]
    },
    {
      "name": "Development Practices",
      "keywords": [
        "Human-Computer Interaction", "User-centered design", "Agile"
      ]

    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [],
  "references": []
}